{
  "topic": {
    "help": "Topic pattern in which the records will be sent.  '{stream}' to send the message to a specific topic based on these values. Notice that the topic name will be transformed to a standard naming convention.",
    "label": "Topic",
    "placeholder": "sample.topic"
  },
  "clientId": {
    "help": "An ID string to pass to the server when making requests. The purpose of this is to be able to track the source of requests beyond just ip/port by allowing a logical application name to be included in server-side request logging.",
    "label": "Client ID",
    "placeholder": "producer"
  },
  "maxRequestSize": {
    "help": "The maximum size of a request in bytes.",
    "label": "Max Request Size",
    "dftVal": 1048576
  },
  "maxInFlightRequestsPerConnection": {
    "help": "The maximum number of unacknowledged requests the client will send on a single connection before blocking. Can be greater than 1, and the maximum value supported with idempotency is 5.",
    "label": "Max in Flight Requests per Connection",
    "dftVal": 5
  },
  "acks": {
    "help": "The number of acknowledgments the producer requires the leader to have received before considering a request complete. This controls the  durability of records that are sent.",
    "dftVal": "1",
    "label": "ACKs",
    "enum": [
      {
        "val": "0",
        "label": "0"
      },
      {
        "val": "1",
        "label": "1"
      },
      {
        "val": "all",
        "label": "all"
      }
    ]
  },
  "compressionType": {
    "help": "The compression type for all data generated by the producer.",
    "dftVal": "none",
    "label": "Compression Type",
    "enum": [
      {
        "val": "none",
        "label": "none"
      },
      {
        "val": "gzip",
        "label": "gzip"
      },
      {
        "val": "snappy",
        "label": "snappy"
      },
      {
        "val": "lz4",
        "label": "lz4"
      },
      {
        "val": "zstd",
        "label": "zstd"
      }
    ]
  },
  "receiveBufferBytes": {
    "help": "The size of the TCP receive buffer (SO_RCVBUF) to use when reading data. If the value is -1, the OS default will be used.",
    "label": "Receive Buffer bytes",
    "dftVal": 32768
  },
  "enableIdempotence": {
    "help": "When set to 'true', the producer will ensure that exactly one copy of each message is written in the stream. If 'false', producer retries due to broker failures, etc., may write duplicates of the retried message in the stream.",
    "dftVal": false,
    "label": "Enable Idempotence",
    "enum": [
      {
        "val": true,
        "label": "是"
      },
      {
        "val": false,
        "label": "否"
      }
    ]
  },
  "socketConnectionSetupTimeoutMs": {
    "help": "The amount of time the client will wait for the socket connection to be established.",
    "label": "Socket Connection Setup Timeout",
    "dftVal": 10000
  },
  "socketConnectionSetupTimeoutMaxMs": {
    "help": "The maximum amount of time the client will wait for the socket connection to be established. The connection setup timeout will increase exponentially for each consecutive connection failure up to this maximum.",
    "label": "Socket Connection Setup Max Timeout",
    "dftVal": 30000
  },
  "deliveryTimeoutMs": {
    "help": "An upper bound on the time to report success or failure after a call to 'send()' returns.",
    "label": "Delivery Timeout",
    "dftVal": 120000
  },
  "retries": {
    "help": "Setting a value greater than zero will cause the client to resend any record whose send fails with a potentially transient error.",
    "label": "Retries",
    "dftVal": 100
  },
  "protocol": {
    "help": "Protocol used to communicate with brokers.",
    "label": "Protocol",
    "dftVal": "PLAINTEXT"
  },
  "bufferMemory": {
    "help": "The total bytes of memory the producer can use to buffer records waiting to be sent to the server.",
    "label": "Buffer Memory",
    "dftVal": 33554432
  },
  "requestTimeoutMs": {
    "help": "The configuration controls the maximum amount of time the client will wait for the response of a request. If the response is not received before the timeout elapses the client will resend the request if necessary or fail the request if retries are exhausted.",
    "label": "Request Timeout",
    "dftVal": 30000
  },
  "lingerMs": {
    "help": "The producer groups together any records that arrive in between request transmissions into a single batched request.",
    "label": "Linger ms",
    "dftVal": 0
  },
  "bootstrapServers": {
    "help": "A list of host/port pairs to use for establishing the initial connection to the Kafka cluster. The client will make use of all servers irrespective of which servers are specified here for bootstrapping&mdash;this list only impacts the initial hosts used to discover the full set of servers. This list should be in the form <code>host1:port1,host2:port2,...</code>. Since these servers are just used for the initial connection to discover the full cluster membership (which may change dynamically), this list need not contain the full set of servers (you may want more than one, though, in case a server is down).",
    "label": "Bootstrap Servers",
    "placeholder": "kafka-broker1:9092,kafka-broker2:9092"
  },
  "testTopic": {
    "help": "Topic to test if can produce messages.",
    "label": "Test Topic",
    "placeholder": "test.topic"
  },
  "batchSize": {
    "label": "Batch Size",
    "dftVal": 16384
  },
  "syncProducer": {
    "help": "Wait synchronously until the record has been sent to Kafka.",
    "dftVal": false,
    "label": "Sync Producer",
    "enum": [
      {
        "val": true,
        "label": "是"
      },
      {
        "val": false,
        "label": "否"
      }
    ]
  },
  "sendBufferBytes": {
    "help": "The size of the TCP send buffer (SO_SNDBUF) to use when sending data. If the value is -1, the OS default will be used.",
    "label": "Send Buffer bytes",
    "dftVal": 131072
  },
  "maxBlockMs": {
    "help": "The configuration controls how long the KafkaProducer's send(), partitionsFor(), initTransactions(), sendOffsetsToTransaction(), commitTransaction() and abortTransaction() methods will block.",
    "label": "Max Block ms",
    "dftVal": 60000
  },
  "clientDnsLookup": {
    "help": "Controls how the client uses DNS lookups. If set to use_all_dns_ips, connect to each returned IP address in sequence until a successful connection is established. After a disconnection, the next IP is used. Once all IPs have been used once, the client resolves the IP(s) from the hostname again. If set to resolve_canonical_bootstrap_servers_only, resolve each bootstrap address into a list of canonical names. After the bootstrap phase, this behaves the same as use_all_dns_ips. If set to default (deprecated), attempt to connect to the first IP address returned by the lookup, even if the lookup returns multiple IP addresses.",
    "dftVal": "use_all_dns_ips",
    "label": "Client DNS Lookup",
    "enum": [
      {
        "val": "default",
        "label": "default"
      },
      {
        "val": "use_all_dns_ips",
        "label": "use_all_dns_ips"
      },
      {
        "val": "resolve_canonical_bootstrap_servers_only",
        "label": "resolve_canonical_bootstrap_servers_only"
      }
    ]
  }
}
